#include <iostream>
using namespace std;
int d = 0;
int Tonguoc(int a)
{
    int i, s;
    d++;
    s = 0;
    for (i = 1; i <= a / 2; i++)
        if (a % i == 0)
            s = s + i;
    return s;
}
int main()
{
    int i, k;
    for (i = 1; i <= 10000; i++)
    {
        k = Tonguoc(i);
        if (i > k)
            if (Tonguoc(k) == i)
                cout << i << " " << k << endl;
    }
    cout << "So lan goi chuong trinh con: " << d;
}
// Kết quả là:
// 284 220
// 1210 1184
// 2924 2620
// 5564 5020
// 6368 6232
// So lan goi chuong trinh con: 17508
// Cụ thể ta có các ước số như sau:
// Kq 1: 284 220
// Các ước của 284: 1-2-4--71-142
// Các ước của 220: 1-2-4-5-10-11-20-22-44-55-110
// Kq 2: 1210 1184
// Các ước của 1210: 1-2-5-10-11-22-55-110-121-242-605
// Các ước của 1184: 1-2-4-8-16-32-37-74-148-296-592
// Kq 3: 2924 2620
// Các ước của 2924: 1-2-4-17-34-43-68-86-172-731-1462
// Các ước của 2620: 1-2-4-5-10-20-131-262-524-655-1310
// Kq 4: 5564 5020
// Các ước của 5564: 1-2-4-13-26-52-107-214-428-1391-2782
// Các ước của 5020: 1-2-4-5-10-20-251-502-1004-1255-2510
// Kq 5: 6368 6232
// Các ước của 6368: 1-2-4-8-16-32-199-398-796-1592-3184
// Các ước của 6232: 1-2-4-8-19-38-41-76-82-152-164-328-779-1558-3116
// Nhận xét: Với cách làm trên thì ta chỉ gọi đến thủ tục tối đa 10000*2 lần !